; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	spectrograph2 - mode
	thermograph5 - mode
	thermograph1 - mode
	image0 - mode
	spectrograph4 - mode
	spectrograph3 - mode
	spectrograph6 - mode
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	Star7 - direction
	Star2 - direction
	GroundStation1 - direction
	Star0 - direction
	GroundStation5 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph1)
	(supports instrument1 spectrograph4)
	(supports instrument1 spectrograph2)
	(supports instrument1 thermograph5)
	(calibration_target instrument1 Star0)
	(supports instrument2 spectrograph6)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon11)
)
(:goal (and
	(pointing satellite0 Planet12)
	(have_image Star8 spectrograph3)
	(have_image Phenomenon9 spectrograph6)
	(have_image Phenomenon9 spectrograph4)
	(have_image Planet10 thermograph1)
	(have_image Planet10 thermograph5)
	(have_image Phenomenon11 thermograph1)
	(have_image Phenomenon11 spectrograph2)
	(have_image Planet12 spectrograph4)
	(have_image Planet12 spectrograph6)
))

)

; plan
1. (turn_to satellite0 groundstation5 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 groundstation5)
   goals met: 0 of 10
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 10
3. (calibrate satellite0 instrument2 groundstation5)
   added: (calibrated instrument2)
   goals met: 0 of 10
4. (turn_to satellite0 planet12 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 planet12)
   goals met: 1 of 10
5. (take_image satellite0 planet12 instrument2 spectrograph6)
   added: (have_image planet12 spectrograph6)
   goals met: 2 of 10
6. (turn_to satellite0 phenomenon9 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon9)
   goals met: 1 of 10
7. (take_image satellite0 phenomenon9 instrument2 spectrograph6)
   added: (have_image phenomenon9 spectrograph6)
   goals met: 2 of 10
8. (turn_to satellite0 groundstation1 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation1)
   goals met: 2 of 10
9. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 2 of 10
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 10
11. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 2 of 10
12. (turn_to satellite0 star8 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star8)
   goals met: 2 of 10
13. (take_image satellite0 star8 instrument0 spectrograph3)
   added: (have_image star8 spectrograph3)
   goals met: 3 of 10
14. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 3 of 10
15. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 10
16. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   goals met: 3 of 10
17. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 3 of 10
18. (turn_to satellite0 phenomenon11 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 10
19. (take_image satellite0 phenomenon11 instrument1 spectrograph2)
   added: (have_image phenomenon11 spectrograph2)
   goals met: 4 of 10
20. (take_image satellite0 phenomenon11 instrument1 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 5 of 10
21. (turn_to satellite0 phenomenon9 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon9)
   goals met: 5 of 10
22. (take_image satellite0 phenomenon9 instrument1 spectrograph4)
   added: (have_image phenomenon9 spectrograph4)
   goals met: 6 of 10
23. (turn_to satellite0 planet10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet10)
   goals met: 6 of 10
24. (take_image satellite0 planet10 instrument1 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 7 of 10
25. (take_image satellite0 planet10 instrument1 thermograph5)
   added: (have_image planet10 thermograph5)
   goals met: 8 of 10
26. (turn_to satellite0 planet12 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet12)
   goals met: 9 of 10
27. (take_image satellite0 planet12 instrument1 spectrograph4)
   added: (have_image planet12 spectrograph4)
   goals met: 10 of 10
